Tekla.Structures.Model.PlateIntersectsWithIntersectionLineException
The PlateIntersectsWithIntersectionLineException class represents an error when, plate polygon extends beyond intersection line.

Tekla.Structures.Model.PlateIntersectsWithIntersectionLineException.#ctor
Initializes a new instance of the PlateIntersectsWithIntersectionLineException class with "Plate polygon extends beyond intersection line" error message.